[
    {
        "page_content": "Home\n\nCourses\n\nComputer Science\n\nComputer Science\n\nAs the digital economy continues to grow, and new and increasingly powerful technologies emerge, computer science underpins more and more of modern life. At NTU, we’ll use industry projects and collaborative research to help you develop the skills and experience that employers are looking for.\n\nFind your course\n\nOpen days are the perfect way to see what makes life and learning at NTU so special.\n\nBook an open day\n\nUndergraduate courses\n\nArtificial Intelligence\n\n\n\n    - MSc\n\nCloud and Enterprise Computing\n\n\n\n    - MSc\n\nComputer Science\n\n\n\n    - MSc\n\nComputer Science\n\n\n\n    - MComp (Hons)\n\nComputer Science\n\n\n\n    - BSc (Hons)\n\nComputer Science (Games Technology)\n\n\n\n    - BSc (Hons)\n\nComputer Science (with foundation year)\n\n\n\n    - BSc (Hons)\n\nComputer Science - Artificial Intelligence\n\n\n\n    - BSc (Hons)\n\nComputer Science - Artificial Intelligence (with foundation year)\n\n\n\n    - BSc (Hons)\n\nComputer Science - Games Technology (with foundation year)\n\n\n\n    - BSc (Hons)\n\nComputer Science and Mathematics\n\n\n\n    - BSc (Hons)\n\nComputer Science and Mathematics (with foundation year)\n\n\n\n    - BSc (Hons)\n\nComputing\n\n\n\n    - BSc (Hons)\n\nComputing (with foundation year)\n\n\n\n    - BSc (Hons)\n\nCyber Security\n\n\n\n    - MSc\n\nCyber Security\n\n\n\n    - BSc (Hons)\n\nCyber Security (with foundation year)\n\n\n\n    - BSc (Hons)\n\nData Science\n\n\n\n    - MSc\n\nData Science\n\n\n\n    - BSc (Hons)\n\nData Science (with foundation year)\n\n\n\n    - BSc (Hons)\n\nDigital and Technology Solutions Professional (Software Engineering) Level 6 Degree Apprenticeship\n\n\n\n    - BSc (Hons)\n\nData Scientist Level 6 Degree Apprenticeship\n\n\n\n    - BSc (Hons)\n\nMathematics with Data Science\n\n\n\n    - BSc (Hons)\n\nMathematics with Data Science (with foundation year)\n\n\n\n    - BSc (Hons)\n\nSoftware Engineering\n\n\n\n    - MSc\n\nSoftware Engineering\n\n\n\n    - BSc (Hons)\n\nSoftware Engineering (with foundation year)\n\n\n\n    - BSc (Hons)\n\nAbout Computer Science\n\nFrom artificial intelligence to game technology, our courses span the whole spectrum of computer science.\n\nYou’ll study in state-of-the-art facilities at our Clifton Campus, which includes a robot arena, games consoles, networking and security, and human-interactive technology labs. It’s a self-contained campus with all the mod cons and equipment you might need.\n\nYou can count on the support of industry veterans from across the sector – from Fujitsu Systems to the US Department of Homeland Security. You can apply your learning to work placements, live industry briefs and research projects, as you gain real-world experience and enhance your career prospects in computing.\n\nLearn more about Computer Science at NTU\n\nDiscover the inspiring story behind Hannah's decision to pursue Computer Science at NTU. Look through other videos for an insightful tour of our facilities and get a glimpse into the enriching academic journey that awaits you.\n\nCareers in Computer Science\n\nThe industry-focused nature of our courses ensures you stand out from the crowd when it comes to job applications and pursuing your future career. Our graduates are widely respected amongst employers and are perceived as having a competitive edge due to the hands-on approach of our teaching.\n\nOur recent graduates have secured roles at companies including:\n\nNext Retail Ltd\n\nBoots UK\n\nCisco Systems\n\nSchlumberger\n\nExperian\n\nBT\n\nRockstar Games\n\nWorldwide Clinical Trials UK Ltd\n\nAmerican Express\n\nUK Government\n\nThey have gone into a wide variety of job roles including:\n\nBusiness Analyst\n\nProgrammer\n\nProject Software Implementation Officer\n\nWeb Developer\n\nGames Tester\n\nGraduate Game Development and Programmer\n\nSoftware Engineer\n\nCyber Security Analyst\n\nProduct Consultant\n\nExplore Computer Science\n\nFind out about the facilities you'll have access to on your course and the benefits and support you'll receive as an NTU student.\n\nDepartment of Computer Science\n        Welcome to the Computer Science Department at NTU. The department combines internationally significant research with an outstanding record for teaching excellence. Our state-of-the-art facilities and career-focused approach to course design provide the right conditions for students to succeed in their chosen fields.\n\nComputer Science facilities\n        Explore our our Computer Science facilities at our Clifton Campus. You can take a look at the outstanding lab facilities in our ISTeC building.\n\nTake a virtual tour\n        The NTU virtual tour is a great way to get to know our University from the comfort of your own home.\n\nSupporting your success\n        What makes life and learning at NTU so special? Discover just a few of the benefits and free services designed to enhance your student experience.\n\nSearch for a specific course\n\nOrder a prospectus\n\nBook an open day\n\nLearn about life in Nottingham\n\nChat to students or staff\n\nAlso in\n\nComputer Science\n\nComputer Science facilities",
        "metadata": {
            "source": "https://www.ntu.ac.uk/course/computer-science",
            "title": "Computer Science | Nottingham Trent University",
            "description": "Pursue your passion for computer science. You'll get involved in industry projects and  research to develop skills and experience employers are looking for.",
            "language": "en",
            "filename": "https://www.ntu.ac.uk/course/computer-science"
        }
    },
    {
        "page_content": "Home\n\nStudy\n\nAcademic Schools\n\nScience and Technology\n\nDepartment of Computer Science\n\nDepartment of Computer Science\n\nWelcome to the Department of Computer Science at NTU. The department combines internationally significant research with an outstanding record for teaching excellence. Our state-of-the-art facilities and career-focused approach to course design provide the right conditions for students to succeed in their chosen fields.\n\nOur undergraduate and postgraduate courses are designed to be industrially relevant with the right balance of theory and practice. The British Computing Society (BCS) have accredited all of our undergraduate degrees to Chartered IT Professional (CITP) status, and towards Chartered Engineer (CEng) status with the Engineering Council. We are a thriving department combining expertise with modern facilities and equipment to create an outstanding environment for learning and development.\n\nThe strength and relevance of our teaching and research are underpinned by a healthy synergy with a network of external businesses and organisations. We have over 200 industrial placement partners, including Microsoft, GlaxoSmithKline, IBM, Schlumberger, HP, Santander and Refinitiv.\n\nResearch activity within the department is wide-ranging and collaborations and funding for research have been gained from a variety of sources including Innovate UK, the EPSRC, the US Department of Homeland Security and the EU. Our research is internationally recognised, particularly in the areas of serious games, computational intelligence and security.\n\nMeet the team\n\nAhmad Lotfi\n        \t                \n                                                                                                Professor and Head of Department\n                                                                                        \n                                                                                                                                                                                        \n                                                                                                Computer Science\n\nJoanna Hartley\n            \n            \n                \n                Deputy Head of Department\n                \n            \n            \n              \n                \n                    \n                \n            \n            \n                        \n                \n                Computer Science\n\nZoheir Ezziane\n            \n            \n                \n                Senior Lecturer\n                \n            \n            \n              \n                \n                    \n                \n            \n            \n                        \n                \n                    \n                    School of Science & Technology\n\nView all staff\n\nComputer Science courses\n\nIf you’re just starting out and are passionate about working in computing and technology, our accredited undergraduate computing courses can help your get there.\n\nView our courses\n\nOur research\n\nThe Computing and Informatics Research Centre’s (CIRC) unifying and overarching research vision is ‘Enabling Digital Technology’ and is grounded in high-quality, interdisciplinary work with expertise in advanced computer science topics with links to partners from both academia and industry. The CIRC’s research is delivered by four groups.\n\nCentre for Computer Science and Informatics (CIRC)\n        Harnessing enabling technologies ranging from machine learning, AI, and advanced display technologies, to intelligent sensors and robotics to drive advances for individuals and society.\n\nResearch groups\n\nInteractive Systems Research Group (ISRG)\n        The Interactive Systems Research Group focuses on the development of new technologies for the cognitive and physical rehabilitation of users within the real world.\n\nComputational Intelligence and Applications Research Group (CIA)\n        This research group brings together academics researching in the areas of computational intelligence applications.\n\nCognitive Computing and Brain Informatics Research Group (CCBI) \n        This research group is centred around brain research, mainly brain computer interfacing (BCI) including EEG hyper scanning, and body sensor networking (BCI).\n\nCyber Security Research Group (CSRG)\n        The cyber security research group (CSRG) is a dynamic team of seasoned professionals dedicated to researching and implementing effective solutions to safeguard against cyber threats.\n\nResearch Excellence Framework (REF) 2021\n\nIn the latest Research Excellence Framework (REF) 2021, 86% of NTU's research impact was assessed to be either world-leading or internationally excellent. The overall quality of each Unit of Assessment NTU submitted to REF in 2021 also saw an improvement from the previous REF in 2014.\n\nFind out more about REF 2021\n\nFind out more about our research\n\nOur facilities\n\nWith over £8 million invested, our computer science students will study in facilities designed to very high specifications with a variety of electronic and communication laboratories.\n\nComputer Science Facilities\n        Find out about our impressive range of Computer Science facilities available in the Interdisciplinary Science and Technology Centre (ISTeC).\n\nInterdisciplinary Science and Technology Centre (ISTeC)\n        ISTeC is a cutting-edge 13 million facility at NTU, supporting research and majors in Computer Science, Bioscience, Chemistry, and Sport Science.\n\nLatest news\n\nAccelerate your research with NTU’s new supercomputing Hydra AI service\n        \n            Wed 15 May 2024\n\nStudy will develop AI to spot lung cancer risk from patient data\n        \n            Mon 11 Mar 2024\n\nCARPHA and NTU Forge Strategic Partnership to Tackle NCDs\n        \n            Thu 25 May 2023\n\nNotts Healthcare launches interactive walks App to boost physical and mental health\n        \n            Thu 30 Jun 2022\n\nNTU researcher among the ‘Top 50 Women in Engineering’\n        \n            Thu 23 Jun 2022\n\nNTU among universities to receive first-ever Turing Network Development Awards\n        \n            Wed 02 Feb 2022\n\nView all news\n\nOur events\n\n31\n                May\n            \n        \n        \n        \n            Sport Engineering Seminar Day 2024\n            \n                \n                \n                NTU Clifton Campus, \n                Teaching and Learning Building, \n                Clifton Lane, \n                Clifton, \n                Nottinghamshire, \n                \n                NG11 8NS\n\n18\n                Jun\n            \n        \n        \n        \n            Physical Activity and the Endocrine system 2024\n\n19\n                Jun\n            \n        \n        \n        \n            Secrets of Healthy Ageing - Boost Your Immune System\n            \n                \n                \n                Nottingham Trent University, \n                Room 005 - Dryden Building, \n                \n                Nottingham, \n                \n                \n                NG1 4FZ\n\n04\n                Jul\n            \n        \n        \n        \n            4D Materials Design and Additive Manufacturing 2024 Conference\n            \n                \n                \n                Palais des Congrès (Congress Center) Quai l’Herminier, 2000 Ajaccio, France., \n                \n                \n                Ajaccio, \n                \n                France,\n\n24\n                Jul\n            \n        \n        \n        \n            Joint NTU Department of Engineering and IEEE Nanotechnology Chapter (UK & Ireland) distinguished lecture\n            \n                Lecture Theatre 3, \n                \n                Teaching and Learning Building, \n                Clifton Campus, \n                \n                \n                \n                \n                NG11 8NS\n\n28\n                Aug\n            \n        \n        \n        \n            3rd International Conference of Quantum & Nonlinear Nanophotonics (ICQNN)\n            \n                \n                \n                Nottingham Trent University, Clifton Campus, \n                \n                \n                \n                Nottinghamshire, \n                United Kingdom, \n                NG11 8NS\n\nView all events\n\nBCS – The Chartered Institute for IT\n\nFollow us\n\nConnect through x\n\nConnect through facebook\n\nAlso in\n\nAcademic Schools\n\nAnimal, Rural and Environmental Sciences\n\nArchitecture, Design and the Built Environment\n\nNottingham School of Art & Design\n\nArts and Humanities\n\nNottingham Business School\n\nNottingham Law School\n\nScience and Technology\n\nDepartment of Biosciences\n\nDepartment of Chemistry\n\nDepartment of Computer Science\n\nDepartment of Engineering\n\nDepartment of Forensic Science\n\nDepartment of Mathematics\n\nDepartment of Physics\n\nDepartment of Sport Science\n\nLeadership Team - Science and Technology\n\nForensic Science Short Courses\n\nView leadership team\n\nView all staff\n\nView all news\n\nSearch our research\n\nOpportunities\n\nThe John van Geest Cancer Research Centre\n\nPhysics and Mathematics Scholarship Group\n\nSocial Sciences\n\nNTU in Mansfield\n\nView all NLS staff\n\nView all NLS News\n\nView all NLS events\n\nNLS Leadership Team\n\nNLS Legal",
        "metadata": {
            "source": "https://www.ntu.ac.uk/study-and-courses/academic-schools/science-and-technology/Computer-Science",
            "title": "Department of Computer Science | Nottingham Trent University",
            "description": "Digital experts are at the core of modern society. Meet Nottingham Trent University’s Department of Computer Science.",
            "language": "en",
            "filename": "https://www.ntu.ac.uk/study-and-courses/academic-schools/science-and-technology/Computer-Science"
        }
    }
]